---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.BaseHeatLoadOn
source: html/d09094ec-84c5-f801-0a00-32aed37a6c07.htm
---
# Autodesk.Revit.DB.Mechanical.Space.BaseHeatLoadOn Property

The heat load-on.

## Syntax (C#)
```csharp
public BaseLoadOn BaseHeatLoadOn { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when the values is not kUseDefaultLoad or kUseEnteredLoad.